### CA1 – Data Preparation HDip

#### 1.	FIRST STEPS
Importing the required libraries pandas and “numpy” to start the project, in case it needs other libraries it will be imported when necessary it comes.

In [1]:
import pandas as pd
import numpy as np

import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline
sns.set()

Loading the dataset using the method “`.read_csv`” to import the required data existing in the .csv file.

In [2]:
df = pd.read_csv("student_data.csv")

### Inspecting the Data Set

The first command useful to start understanding the data is “`.head()`” to check the first five observations and features contained in the data frame after loaded. This command was important and necessary to get the first impression of it, returning that this dataset has 5 rows (features) and 37 columns (observations).

In [3]:
df.head()

,Marital status,Application mode,Application order,Course,Daytime/evening attendance,Previous qualification,Previous qualification (grade),Nacionality,Mother's qualification,Father's qualification,...,Curricular units 2nd sem (credited),Curricular units 2nd sem (enrolled),Curricular units 2nd sem (evaluations),Curricular units 2nd sem (approved),Curricular units 2nd sem (grade),Curricular units 2nd sem (without evaluations),Unemployment rate,Inflation rate,GDP,Target
0,1,17,5,171.0,1,1,122.0,1,19,12.0,...,0,0.0,0,0,0.000000,0,10.8,1.4,1.74,Dropout
1,1,15,1,9254.0,1,1,160.0,1,1,3.0,...,0,6.0,6,6,13.666667,0,13.9,-0.3,0.79,Graduate
2,1,1,5,9070.0,1,1,122.0,1,37,37.0,...,0,6.0,0,0,0.000000,0,10.8,1.4,1.74,Dropout
3,1,17,2,9773.0,1,1,122.0,1,38,37.0,...,0,6.0,10,5,12.400000,0,9.4,-0.8,-3.12,Graduate
4,2,39,1,8014.0,0,1,100.0,1,37,38.0,...,0,6.0,6,6,13.000000,0,13.9,-0.3,0.79,Graduate

Thereafter using the command “shape” shows us the complete body of the data in this case 4424 observations and 37 features to be analysed.

In [4]:
df.shape

(4424, 37)

Use “```.info()```” next to Print a concise summary of a DataFrame. This method prints information about a DataFrame including the index dtype and columns, non-null values and memory usage. (The Pandas Development Team, 2022). Getting this information it was necessary to learn the names of features existing and the difference between the total of observations shown before in the “shape” command and their respective data types.

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4424 entries, 0 to 4423
Data columns (total 37 columns):
 #   Column                                          Non-Null Count  Dtype
---  ------                                          --------------  -----
 0   Marital status                                  4424 non-null   object
 1   Application mode                                4424 non-null   int64
 2   Application order                               4424 non-null   int64
 3   Course                                          4423 non-null   float64
 4   Daytime/evening attendance                      4424 non-null   int64
 5   Previous qualification                          4424 non-null   int64
 6   Previous qualification (grade)                  4424 non-null   float64
 7   Nacionality                                     4424 non-null   int64
 8   Mother's qualification                          4424 non-null   int64
 9   Father's qualification                          4423 non-null   float64
 10  Mother's occupation                             4424 non-null   int64
 11  Father's occupation                             4424 non-null   int64
 12  Admission grade                                 4423 non-null   float64
 13  Displaced                                       4424 non-null   object
 14  Educational special needs                       4424 non-null   int64
 15  Debtor                                          4423 non-null   float64
 16  Tuition fees up to date                         4423 non-null   object
 17  Gender                                          4424 non-null   int64
 18  Scholarship holder                              4424 non-null   int64
 19  Age at enrollment                               4424 non-null   object
 20  International                                   4423 non-null   float64
 21  Curricular units 1st sem (credited)             4424 non-null   object
 22  Curricular units 1st sem (enrolled)             4424 non-null   int64
 23  Curricular units 1st sem (evaluations)          4424 non-null   int64
 24  Curricular units 1st sem (approved)             4424 non-null   int64
 25  Curricular units 1st sem (grade)                4423 non-null   float64
 26  Curricular units 1st sem (without evaluations)  4424 non-null   int64
 27  Curricular units 2nd sem (credited)             4424 non-null   int64
 28  Curricular units 2nd sem (enrolled)             4423 non-null   float64
 29  Curricular units 2nd sem (evaluations)          4424 non-null   int64
 30  Curricular units 2nd sem (approved)             4424 non-null   int64
 31  Curricular units 2nd sem (grade)                4423 non-null   float64
 32  Curricular units 2nd sem (without evaluations)  4424 non-null   int64
 33  Unemployment rate                               4424 non-null   float64
 34  Inflation rate                                  4424 non-null   float64
 35  GDP                                             4424 non-null   float64
 36  Target                                          4424 non-null   object
dtypes: float64(12), int64(19), object(6)
memory usage: 1.2+ MB

The command “```.isnull().sum()```” was essential in this part of inspecting the data set to know the existent missing values in each feature.

In [6]:
df.isnull().sum()

Marital status                                    0
Application mode                                  0
Application order                                 0
Course                                            1
Daytime/evening attendance                        0
Previous qualification                            0
Previous qualification (grade)                    0
Nacionality                                       0
Mother's qualification                            0
Father's qualification                            1
Mother's occupation                               0
Father's occupation                               0
Admission grade                                   1
Displaced                                         0
Educational special needs                         0
Debtor                                            1
Tuition fees up to date                           1
Gender                                            0
Scholarship holder                                0
Age at enrollment                                 0
International                                     1
Curricular units 1st sem (credited)               0
Curricular units 1st sem (enrolled)               0
Curricular units 1st sem (evaluations)            0
Curricular units 1st sem (approved)               0
Curricular units 1st sem (grade)                  1
Curricular units 1st sem (without evaluations)    0
Curricular units 2nd sem (credited)               0
Curricular units 2nd sem (enrolled)               1
Curricular units 2nd sem (evaluations)            0
Curricular units 2nd sem (approved)               0
Curricular units 2nd sem (grade)                  1
Curricular units 2nd sem (without evaluations)    0
Unemployment rate                                 0
Inflation rate                                    0
GDP                                               0
Target                                            0
dtype: int64

With a more refined code “```.isnull().sum()[df.isnull().sum() > 0]```” it was possible to get just the specific features that exist missing values, in this case, the columns: 

- Course;
- Father's qualification;
- Admission grade;
- Debtor;
- Tuition fees up to date;
- International;
- Curricular units 1st sem (grade);
- Curricular units 2nd sem (enrolled);
- Curricular units 2nd sem (grade).

In [7]:
df.isnull().sum()[df.isnull().sum() > 0]

Course                                 1
Father's qualification                 1
Admission grade                        1
Debtor                                 1
Tuition fees up to date                1
International                          1
Curricular units 1st sem (grade)       1
Curricular units 2nd sem (enrolled)    1
Curricular units 2nd sem (grade)       1
dtype: int64

#### Result: Features missing values

- Course 1
- Father's qualification 1
- Admission grade 1
- Debtor 1
- Tuition fees up to date 1
- International 1
- Curricular units 1st sem (grade) 1
- Curricular units 2nd sem (enrolled) 1
- Curricular units 2nd sem (grade) 1

---

#### 2.	DATA CLEANING


Before analysing the missing values, opted to check the types of data together with the file “`student_data_dictionary.xlsx`” provided, after some initial tests using “`.df.head()`”. Noticed that wasn't possible to get the visual information about the 37 features and check their respective Type, so, in this case, opted to use the “`.iloc`” method, to get the first 13 features, after the middle 13 features and the last 13 features.

```python
df.iloc[:, :13].head(5)
df.iloc[:, 13:26].head(5)
df.iloc[:, 26:37].head(5)
```

In [8]:
df.iloc[:, :13].head(5)

,Marital status,Application mode,Application order,Course,Daytime/evening attendance,Previous qualification,Previous qualification (grade),Nacionality,Mother's qualification,Father's qualification,Mother's occupation,Father's occupation,Admission grade
0,1,17,5,171.0,1,1,122.0,1,19,12.0,5,9,127.3
1,1,15,1,9254.0,1,1,160.0,1,1,3.0,3,3,142.5
2,1,1,5,9070.0,1,1,122.0,1,37,37.0,9,9,124.8
3,1,17,2,9773.0,1,1,122.0,1,38,37.0,5,3,119.6
4,2,39,1,8014.0,0,1,100.0,1,37,38.0,9,9,141.5

Analysing the information obtained using “`.iloc`” method and the command “`.dtypes`” found different types shown in the imported file together with the data dictionary, from 37 total features, 12 features with different types, based on those described in the dictionary document and 25 features with their respective types correct.

In [9]:
df.dtypes

Marital status                                     object
Application mode                                    int64
Application order                                   int64
Course                                            float64
Daytime/evening attendance                          int64
Previous qualification                              int64
Previous qualification (grade)                    float64
Nacionality                                         int64
Mother's qualification                              int64
Father's qualification                            float64
Mother's occupation                                 int64
Father's occupation                                 int64
Admission grade                                   float64
Displaced                                          object
Educational special needs                           int64
Debtor                                            float64
Tuition fees up to date                            object
Gender                                              int64
Scholarship holder                                  int64
Age at enrollment                                  object
International                                     float64
Curricular units 1st sem (credited)                object
Curricular units 1st sem (enrolled)                 int64
Curricular units 1st sem (evaluations)              int64
Curricular units 1st sem (approved)                 int64
Curricular units 1st sem (grade)                  float64
Curricular units 1st sem (without evaluations)      int64
Curricular units 2nd sem (credited)                 int64
Curricular units 2nd sem (enrolled)               float64
Curricular units 2nd sem (evaluations)              int64
Curricular units 2nd sem (approved)                 int64
Curricular units 2nd sem (grade)                  float64
Curricular units 2nd sem (without evaluations)      int64
Unemployment rate                                 float64
Inflation rate                                    float64
GDP                                               float64
Target                                             object
dtype: object

**Result:** 12 features with different types, based on described in the dictionary document:

- **Marital status** is Categorical and should be Integer (int64)
- **Course** is Continuous and should be Integer (int64)  
- **Father's qualification** is Continuous and should be Integer (int64)
- **Displaced** is Categorical and should be Integer (int64)
- **Debtor** is Continuous and should be Integer (int64)
- **Tuition fees up to date** is Categorical and should be Integer (int64)
- **Age at enrollment** is Categorical and should be Integer (int64)
- **International** is Continuous and should be Integer (int64)  
- **Curricular units 1st sem (credited)** is Categorical and should be Integer (int64)
- **Curricular units 1st sem (grade)** is Continuous and should be Integer (int64)  
- **Curricular units 2nd sem (enrolled)** is Continuous and should be Integer (int64)  
- **Curricular units 2nd sem (grade)** is Continuous and should be Integer (int64)  

25 features with their respective types ok
- Application mode Integer
- Application order Integer
- Daytime/evening attendance Integer
- Previous qualification Integer
- Previous qualification (grade) Continuous
- Nacionality Integer
- Mother's qualification Integer
- Mother's occupation Integer
- Father's occupation Integer
- Admission grade Continuous
- Educational special needs Integer
- Gender Integer
- Scholarship holder Integer
- Curricular units 1st sem (enrolled) Integer
- Curricular units 1st sem (evaluations) Integer
- Curricular units 1st sem (approved) Integer
- Curricular units 1st sem (without evaluations) Integer
- Curricular units 2nd sem (credited) Integer
- Curricular units 2nd sem (evaluations) Integer
- Curricular units 2nd sem (approved) Integer
- Curricular units 2nd sem (without evaluations) Integer
- Unemployment rate Continuous
- Inflation rate Continuous
- GDP Continuous
- Target Categorical

Before dealing with the different types, opt to understand and resolve the missing values to get the data for their respective correct types, whether this approach does not change some features it will be necessary to convert the whole feature to the correct type.

After using the “.unique()” method to check the missing values in the features that were missing values and different types, and just to make sure all features existent in this file, such as described below:

Marital status, Application mode, Application order, Course, Daytime/evening attendance, Previous qualification, Previous qualification (grade), Nacionality, Mother's qualification, Father's qualification, Mother's occupation, Father's occupation, Admission grade, Displaced, Educational special needs, Debtor, Tuition fees up to date, Gender, Scholarship holder, Age at enrollment, International, Curricular units 1st sem (credited), Curricular units 1st sem (enrolled), Curricular units 1st sem (evaluations), Curricular units 1st sem (approved), Curricular units 1st sem (grade), Curricular units 1st sem (without evaluations), Curricular units 2nd sem (credited), Curricular units 2nd sem (enrolled), Curricular units 2nd sem (evaluations), Curricular units 2nd sem (approved), Curricular units 2nd sem (grade), Curricular units 2nd sem (without evaluations), Unemployment rate, Inflation rate, GDP, Target.

In [10]:
df["Age at enrollment"].unique()

array(['20', '19', '45', '50', '18', '22', '21', '34', '37', '43', '55',
       '39', '29', '24', '27', '23', '26', '33', '35', '25', '44', '36',
       '47', '28', '38', 'UnKnown', '30', '31', '32', '40', '42', '48',
       '49', '46', '41', '70', '60', '53', '51', '52', '54', '61', '58',
       '59', '17', '57', '62'], dtype=object)

It was found the different types of existents in the features below:

- Marital status** = '?'
- Course*** = nan
- Father's qualification*** = nan
- Displaced** = '?'
- Debtor*** = nan
- Tuition fees up to date*** = nan and '?'
- Age at enrollment** = 'UnKnown'
- International*** = nan
- Curricular units 1st sem (credited)** = 'Na'
- Curricular units 1st sem (grade)*** = nan
- Curricular units 2nd sem (enrolled)*** = nan
- Curricular units 2nd sem (grade)*** = nan
- Admission grade* = nan

The meaning of * after the feature’s name:
- (*) Missing Values
- (**) Different Data Types
- (***) Missing Values and Different Data Types

The feature “Target”, there are some divergences, should have just three category classification tasks (Dropout, Enrolled, and Graduate) and be found: “Grad”, “graduate”, “Drop” and “dropout”.

#### 3.	MARK INVALID VALUES AS MISSING (NAN)

All different missing values existents such as before: “`?, UnKnown and Na`” have been marked now as NaN to get easy in case needed to catch them in the same data frame.

In [11]:
missing_value_formats = ["?", "UnKnown", "Na"]

In [12]:
df = pd.read_csv("student_data.csv", na_values = missing_value_formats)

Now that all missing values are marked with NaN, the “`.unique()`” method was used to check the missing values and make sure whether they have been changed or not.

In [13]:
df["Displaced"].unique()

array([ 1.,  0., nan])

After it was created a new data frame variable using the method “`.dropna()`” with the parameter “`axis = 0`” to drop all observations to check if the data set types would be fixed.

In [14]:
new_df = df.dropna(axis = 0)

In [15]:
new_df.isnull().values.any()

False

Using the methods “`.isnull()`”, “`.values`” and “`.any()`” was checked the result: False that there were no missing values in the dataset.

In [16]:
# new_df.dtypes

Next using “.dtypes” methods and checked if the respective types it was correct or not, and not did any difference, the approach thought before to resolve the missing values after converting the whole feature to the correct type it was unsuccessful. There are no more missing values at the moment although the data types remain the same, so instead to deal with the missing values first it will try first to fix the data types.

After reading the Pandas Conversion documentation and trying to use “`DataFrame.astype(dtype[, copy, errors])`” Cast a pandas object to a specified dtype., “`DataFrame.convert_dtypes([infer_objects, ...])`” Convert columns to the best possible dtypes using dtypes supporting pd.NA., (The Pandas Development Team, 2024) and read the error “`IntCastingNaNError: Cannot convert non-finite values (NA or inf) to integer`” informed by the Jypter notebook, get understood that needs to deal with missing values first and next move to the others steps.

#### 4.	DEALING WITH MISSING DATA AND STANDARDIZE CATEGORIES

There are 13 features missing data: Marital status, Course, Father's qualification, Admission grade,  Displaced, Debtor, Tuition fees up to date, Age at enrollment, International, Curricular units 1st sem (credited), Curricular units 1st sem (grade), Curricular units 2nd sem (enrolled) and Curricular units 2nd sem (grade). Let’s check one by one:

- **Marital status** is Categorical and should be Integer, there are just finite specific values to be part of the data such as those available on the data dictionary document, for this specific case, opted to drop the whole observation;
- **Course** is Continuous and should be Integer, same as Marital status, there are just finite specific values to be part of the data;
- **Father's qualification** is Continuous and should be Integer, same as the two before;
- **Admission grade** is missing a value but is Continuous, it is already at the right data type, opted to use the method “.mean()” to replace the NaN(s) value missing;
- **Displaced** is Categorical and should be Integer, limited values, same as before;
- **Debtor** is Continuous and should be Integer, limited values, same as before;
- **Tuition** fees up to date is Categorical and should be Integer, limited values, same as before;
- **Age at enrollment** is Categorical and should be Integer, with limited values, same as before, there is no way to guess which is the age;
- **International** is Continuous and should be Integer, limited values, same as before;
- **Curricular units 1st sem (credited)** is Categorical and should be Integer, limited values, same as before, in this case, I could use the method “.mean()”, but there are lots of observations with 0 as value, so opted to drop since data lost is minimal;
- **Curricular units 1st sem (grade)** is Continuous and should be Integer (int64), opted to use the method “.mean()” to replace the NaN(s) value missing;
- **Curricular units 2nd sem (enrolled)** is Continuous and should be Integer, dropped after drop  Displaced;
- **Curricular units 2nd sem (grade)** is Continuous and should be Integer, same as “Curricular units 1st sem (grade)”;

The command “`.isnull()].head()`” was used to check each row that contains NaN in their respective features/observations.

In [17]:
df[df['Marital status'].isnull()].head()

,Marital status,Application mode,Application order,Course,Daytime/evening attendance,Previous qualification,Previous qualification (grade),Nacionality,Mother's qualification,Father's qualification,...,Curricular units 2nd sem (credited),Curricular units 2nd sem (enrolled),Curricular units 2nd sem (evaluations),Curricular units 2nd sem (approved),Curricular units 2nd sem (grade),Curricular units 2nd sem (without evaluations),Unemployment rate,Inflation rate,GDP,Target
154,NaN,43,1,9853.0,1,1,115.0,1,3,37.0,...,0,6.0,12,3,10.0,0,9.4,-0.8,-3.12,Dropout

Used “`.dropna`” to drop their respective observations, with the parameter “`subset`” “Labels along other axis to consider, e.g. if you are dropping rows these would be a list of columns to include.” and the parameter “`inplace`” “Whether to modify the DataFrame rather than creating a new one.” (The Pandas Development Team, 2024b).

In [18]:
df.dropna(subset=['Marital status', 'Course', 'Father\'s qualification', 'Displaced', 'Debtor', 'Tuition fees up to date', 'Age at enrollment', 'International', 'Curricular units 1st sem (credited)'], inplace = True)

After checking the missing values again with “`.isnull().sum()[df.isnull().sum() > 0]`” to get just the specific features that exist missing values.

In [19]:
df.isnull().sum()[df.isnull().sum() > 0]

Admission grade                     1
Curricular units 1st sem (grade)    1
Curricular units 2nd sem (grade)    1
dtype: int64

In this case: Admission grade, Curricular units 1st sem (grade) and Curricular units 2nd sem (grade), that were used other approach with method “.mean()” to fill in the NaN(s) value missing.

In [20]:
df['Admission grade'] = df['Admission grade'].fillna(int(df['Admission grade'].mean()))
df['Curricular units 1st sem (grade)'] = df['Curricular units 1st sem (grade)'].fillna(int(df['Curricular units 1st sem (grade)'].mean()))
df['Curricular units 2nd sem (grade)'] = df['Curricular units 2nd sem (grade)'].fillna(int(df['Curricular units 2nd sem (grade)'].mean()))

Next, it was used “.isnull().sum()” to finally check if still has or does not have any missing values.

In [21]:
# df.isnull().sum()

The feature “`Target`” still has some divergences, used the method “`.replace`” with the parameter “`inplace = True`” to correct the divergences, Grad to Graduate, graduate to Graduate, Drop to Dropout and dropout to Dropout.

In [22]:
df["Target"].unique()

array(['Dropout', 'Graduate', 'Enrolled', 'Grad', 'graduate', 'Drop',
       'dropout'], dtype=object)

In [23]:
df['Target'].replace('Grad', 'Graduate', inplace = True)
df['Target'].replace('graduate', 'Graduate', inplace = True)
df['Target'].replace('Drop', 'Dropout', inplace = True)
df['Target'].replace('dropout', 'Dropout', inplace = True)

After checking with “`.unique()`” method if the categories are correct now.

In [24]:
df["Target"].unique()

array(['Dropout', 'Graduate', 'Enrolled'], dtype=object)

After it was checked if there were any duplicated observations in the data frame, none were found.

In [25]:
df[df.duplicated()].shape

(0, 37)

#### 5.	DEALING WITH DATA TYPES

Changed the data types for the features 12 features: Marital status, Course, Father’s qualification, Displaced, Debtor, Tuition fees up to date, Age at enrollment, International, Curricular units 1st sem (credited), Curricular units 1st sem (grade), Curricular units 2nd sem (enrolled), Curricular units 2nd sem (grade) using “.astype(int)”.

In [26]:
df[['Marital status', 'Course', 'Father\'s qualification', 'Displaced', 'Debtor', 'Tuition fees up to date', 'Age at enrollment', 'International', 'Curricular units 1st sem (credited)', 'Curricular units 1st sem (grade)', 'Curricular units 2nd sem (enrolled)', 'Curricular units 2nd sem (grade)']] = df[['Marital status', 'Course', 'Father\'s qualification', 'Displaced', 'Debtor', 'Tuition fees up to date', 'Age at enrollment', 'International', 'Curricular units 1st sem (credited)', 'Curricular units 1st sem (grade)', 'Curricular units 2nd sem (enrolled)', 'Curricular units 2nd sem (grade)']].astype(int)

After that checking with “.dtypes” whether has been changed just the specific features before.

In [27]:
df[['Marital status', 'Course', 'Father\'s qualification', 'Displaced', 'Debtor', 'Tuition fees up to date', 'Age at enrollment', 'International', 'Curricular units 1st sem (credited)', 'Curricular units 1st sem (grade)', 'Curricular units 2nd sem (enrolled)', 'Curricular units 2nd sem (grade)']].dtypes

Marital status                         int64
Course                                 int64
Father's qualification                 int64
Displaced                              int64
Debtor                                 int64
Tuition fees up to date                int64
Age at enrollment                      int64
International                          int64
Curricular units 1st sem (credited)    int64
Curricular units 1st sem (grade)       int64
Curricular units 2nd sem (enrolled)    int64
Curricular units 2nd sem (grade)       int64
dtype: object

And it checked all data frame with “.dtypes” as well as with the dictionary.

In [28]:
df.dtypes

Marital status                                      int64
Application mode                                    int64
Application order                                   int64
Course                                              int64
Daytime/evening attendance                          int64
Previous qualification                              int64
Previous qualification (grade)                    float64
Nacionality                                         int64
Mother's qualification                              int64
Father's qualification                              int64
Mother's occupation                                 int64
Father's occupation                                 int64
Admission grade                                   float64
Displaced                                           int64
Educational special needs                           int64
Debtor                                              int64
Tuition fees up to date                             int64
Gender                                              int64
Scholarship holder                                  int64
Age at enrollment                                   int64
International                                       int64
Curricular units 1st sem (credited)                 int64
Curricular units 1st sem (enrolled)                 int64
Curricular units 1st sem (evaluations)              int64
Curricular units 1st sem (approved)                 int64
Curricular units 1st sem (grade)                    int64
Curricular units 1st sem (without evaluations)      int64
Curricular units 2nd sem (credited)                 int64
Curricular units 2nd sem (enrolled)                 int64
Curricular units 2nd sem (evaluations)              int64
Curricular units 2nd sem (approved)                 int64
Curricular units 2nd sem (grade)                    int64
Curricular units 2nd sem (without evaluations)      int64
Unemployment rate                                 float64
Inflation rate                                    float64
GDP                                               float64
Target                                             object
dtype: object

#### 6.	SCALING / TRANSFORMATION AND DATA NORMALISATION